[
  {
    "sentence": "We zijn gisteren pas laat thuis ______.",
    "options": [
      "aangekomen",
      "opgekomen",
      "voorgekomen",
      "bijgekomen"
    ],
    "correct": 0,
    "explanation": "'Aankomen' = ergens arriveren. Standaard woord voor het bereiken van een bestemming. Gebruik: thuis aankomen, op het station aankomen, in Amsterdam aankomen.",
    "wrongExplanations": {
      "1": "'Opkomen' = omhoog verschijnen (zon, idee) of opstaan voor een zaak. Hier gaat het over thuiskomen na een reis.",
      "2": "'Voorkomen' = plaatsvinden of voor jezelf lijken. Je arriveert thuis — het is geen gebeurtenis die 'plaatsvindt'.",
      "3": "'Bijkomen' = herstellen na ziekte, schrik of narcose. Thuis aankomen is arriveren, niet herstellen."
    },
    "hint": "Je was onderweg en bent nu thuis. Welk prefix past bij het bereiken van een bestemming?"
  },
  {
    "sentence": "De trein uit Amsterdam is net ______.",
    "options": [
      "terechtgekomen",
      "aangekomen",
      "meegekomen",
      "opgekomen"
    ],
    "correct": 1,
    "explanation": "'Aankomen' = arriveren op een bestemming. Standaard voor treinen, vluchten, pakketten en personen.",
    "wrongExplanations": {
      "0": "'Terechtkomen' = toevallig ergens belanden. Een trein rijdt op schema — hij belandt niet toevallig ergens.",
      "2": "'Meekomen' = samen met iemand anders gaan. De trein rijdt zelf — hij gaat niet mee.",
      "3": "'Opkomen' = omhoog verschijnen. Treinen rijden horizontaal."
    },
    "hint": "De trein was onderweg en is nu op zijn bestemming. Welk prefix past bij het bereiken van een punt?"
  },
  {
    "sentence": "Ik ben de afgelopen maand twee kilo ______.",
    "options": [
      "doorgekomen",
      "aangekomen",
      "opgekomen",
      "omgekomen"
    ],
    "correct": 1,
    "explanation": "'Aankomen' = in gewicht toenemen. Niets met reizen — het gaat puur om lichaamsgewicht. Tegenovergestelde: afvallen.",
    "wrongExplanations": {
      "0": "'Doorkomen' = een moeilijke periode overleven of de selectie halen. Kilo's overleven geen periodes.",
      "2": "'Opkomen' = verschijnen of opstaan voor een zaak. Lichaamsgewicht verschijnt niet.",
      "3": "'Omkomen' = sterven bij een ramp of ongeluk. Dat is zeker niet de bedoeling van twee kilo erbij."
    },
    "hint": "Dit heeft niets met reizen te maken. Welk werkwoord gebruik je als gewicht bij je lichaam 'aankomt'?"
  },
  {
    "sentence": "De zon is vandaag vroeg ______.",
    "options": [
      "aangekomen",
      "opgekomen",
      "afgekomen",
      "meegekomen"
    ],
    "correct": 1,
    "explanation": "'Opkomen' = verschijnen aan de horizon. Altijd omhoogwaartse beweging. Gebruik: de zon komt op, de maan komt op, een ster komt op.",
    "wrongExplanations": {
      "0": "'Aankomen' = arriveren op een bestemming. De zon reist niet naar een punt — ze verschijnt aan de horizon.",
      "2": "'Afkomen' = naar beneden of ergens naartoe komen. De zon gaat juist omhóóg aan de horizon.",
      "3": "'Meekomen' = samen met iemand gaan. De zon beweegt niet met iemand mee."
    },
    "hint": "Denk aan de bewegingsrichting: omhoog of omlaag? Welk prefix past bij omhoog?"
  },
  {
    "sentence": "Er is een goed idee bij me ______.",
    "options": [
      "afgekomen",
      "overkomen",
      "opgekomen",
      "bijgekomen"
    ],
    "correct": 2,
    "explanation": "'Opkomen' = in je hoofd verschijnen (idee, gedachte). Beweging van beneden naar boven — het idee 'borrelt op'. Gebruik: een idee komt bij me op, er komt een gedachte bij me op.",
    "wrongExplanations": {
      "0": "'Afkomen' = naar beneden komen. Een idee daalt niet — het borrelt op.",
      "1": "'Overkomen' = een indruk maken op anderen. Een idee maakt geen indruk op jou — het verschijnt in je hoofd.",
      "3": "'Bijkomen' = herstellen of erbij komen. Een idee herstelt nergens van."
    },
    "hint": "Een idee verschijnt ineens in je hoofd. Welk prefix past bij iets dat 'omhoog borrelt'?"
  },
  {
    "sentence": "Hoe ben je op dat idee ______?",
    "options": [
      "aangekomen",
      "gekomen",
      "binnengekomen",
      "afgekomen"
    ],
    "correct": 1,
    "explanation": "'Op een idee komen' = een idee krijgen of bedenken. Vaste combinatie zonder prefix.",
    "wrongExplanations": {
      "0": "'Aankomen' = arriveren op een bestemming. Een idee is geen bestemming.",
      "2": "'Binnenkomen' = naar binnen gaan of ontvangen worden. Je gaat nergens naar binnen bij een idee.",
      "3": "'Afkomen' = naar beneden of ergens naartoe komen. Ideeën dalen niet."
    },
    "hint": "Je vraagt hoe iemand dit idee heeft gekregen. Welk werkwoord past bij 'op een idee komen'?"
  },
  {
    "sentence": "We moeten ______ tegen discriminatie.",
    "options": [
      "opkomen",
      "aankomen",
      "meekomen",
      "uitkomen"
    ],
    "correct": 0,
    "explanation": "'Opkomen tegen' = protesteren, je inzetten tegen iets onrechtvaardigs. Gebruik: opkomen tegen discriminatie, opkomen voor je rechten.",
    "wrongExplanations": {
      "1": "'Aankomen' = arriveren. Je arriveert niet tégen discriminatie.",
      "2": "'Meekomen' = samen gaan of bijhouden. Je gaat niet samen mét discriminatie.",
      "3": "'Uitkomen' = openbaar worden of openlijk erkennen. Je komt niet uit tégen discriminatie — je komt ervoor op."
    },
    "hint": "Je stelt je op tégen iets oneerlijks. Welk prefix past bij opstaan voor een zaak?"
  },
  {
    "sentence": "Ze is voor haar rechten ______.",
    "options": [
      "aangekomen",
      "binnengekomen",
      "meegekomen",
      "opgekomen"
    ],
    "correct": 3,
    "explanation": "'Opkomen voor' = je inzetten voor iets, verdedigen. Gebruik: opkomen voor je rechten, opkomen voor iemand anders.",
    "wrongExplanations": {
      "0": "'Aankomen' = arriveren. Je arriveert niet voor rechten.",
      "1": "'Binnenkomen' = naar binnen gaan of ontvangen worden. Ze gaat nergens naar binnen — ze verdedigt iets.",
      "2": "'Meekomen' = samen gaan of bijhouden. Ze gaat niet ergens naartoe — ze strijdt."
    },
    "hint": "Ze stelt zich op voor haar rechten. Welk prefix past bij opstaan voor een zaak?"
  },
  {
    "sentence": "Na de operatie moest hij langzaam ______.",
    "options": [
      "uitkomen",
      "aankomen",
      "opkomen",
      "bijkomen"
    ],
    "correct": 3,
    "explanation": "'Bijkomen' = herstellen na een operatie, narcose, ziekte of schrik. Gebruik: bijkomen van een operatie, bijkomen van de schrik.",
    "wrongExplanations": {
      "0": "'Uitkomen' = openbaar worden of kloppen. Past niet bij lichamelijk herstel na narcose.",
      "1": "'Aankomen' = arriveren of zwaarder worden. Na een operatie herstel je — je arriveert nergens.",
      "2": "'Opkomen' = verschijnen of opstaan voor een zaak. Past niet bij herstel."
    },
    "hint": "Na narcose moet je weer tot jezelf komen. Welk prefix past bij 'er weer bij komen'?"
  },
  {
    "sentence": "Ze is helemaal ______ van de schrik.",
    "options": [
      "aangekomen",
      "bijgekomen",
      "opgekomen",
      "terechtgekomen"
    ],
    "correct": 1,
    "explanation": "'Bijkomen van' = herstellen van een schrik, emotie of lichamelijke klap. Gebruik: bijkomen van de schrik, bijkomen van een val, bijkomen van narcose.",
    "wrongExplanations": {
      "0": "'Aankomen' = arriveren of zwaarder worden. Van een schrik arriveert of word je niet zwaarder.",
      "2": "'Opkomen' = verschijnen of opstaan voor iets. Je staat niet op van een schrik — je herstelt ervan.",
      "3": "'Terechtkomen' = ergens belanden. Je belandt nergens door schrik."
    },
    "hint": "Ze was geschrokken en is nu weer zichzelf. Welk werkwoord gebruik je voor herstel na een emotie?"
  },
  {
    "sentence": "Er zijn nog extra kosten ______.",
    "options": [
      "afgekomen",
      "terechtgekomen",
      "bijgekomen",
      "meegekomen"
    ],
    "correct": 2,
    "explanation": "'Bijkomen' = er extra bij komen, toegevoegd worden. Gebruik: kosten komen erbij, punten komen erbij, werk komt erbij.",
    "wrongExplanations": {
      "0": "'Afkomen' = naar beneden komen. Kosten dalen hier niet — ze worden toegevoegd.",
      "1": "'Terechtkomen' = toevallig ergens belanden. Kosten belanden nergens — ze worden toegevoegd.",
      "3": "'Meekomen' = samen bewegen. Kosten reizen nergens naartoe."
    },
    "hint": "De kosten worden toegevoegd aan iets wat er al was. Welk prefix past bij 'erbij'?"
  },
  {
    "sentence": "Wil je vanavond ook ______?",
    "options": [
      "aankomen",
      "terugkomen",
      "opkomen",
      "meekomen"
    ],
    "correct": 3,
    "explanation": "'Meekomen' = samen met iemand gaan. Gebruik: meekomen naar een feest, meekomen op reis, meekomen naar de vergadering.",
    "wrongExplanations": {
      "0": "'Aankomen' = arriveren op een bestemming. De vraag is of je mégaat — niet of je op een bestemming aankomt.",
      "2": "'Opkomen' = verschijnen of opstaan voor iets. Niet geschikt voor een uitnodiging om samen te gaan.",
      "1": "'Terugkomen' = teruggaan naar een eerdere plek. Je nodigt iemand uit om mee te gaan, niet om terug te komen."
    },
    "hint": "Je vraagt iemand om samen met jou te gaan. Welk prefix past bij 'samen met'?"
  },
  {
    "sentence": "Ze kon niet ______ met de rest van de groep.",
    "options": [
      "meekomen",
      "aankomen",
      "terugkomen",
      "afgekomen"
    ],
    "correct": 0,
    "explanation": "'Meekomen' = bijhouden, het tempo volgen van een groep of uitleg. Gebruik: meekomen in de les, meekomen met de groep, meekomen in een gesprek.",
    "wrongExplanations": {
      "1": "'Aankomen' = arriveren. Ze is onderweg met de groep — er is geen aankomstpunt.",
      "2": "'Terugkomen' = teruggaan naar een eerdere plek. Ze wil niet terug — ze wil bijhouden.",
      "3": "'Afkomen' = naar beneden komen of ergens naartoe komen. Er is geen hoogteverschil of aankomst in deze situatie."
    },
    "hint": "De groep gaat te snel voor haar. Welk prefix past bij 'samen bewegen' of 'bijhouden'?"
  },
  {
    "sentence": "De waarheid is eindelijk ______.",
    "options": [
      "uitgekomen",
      "meegekomen",
      "afgekomen",
      "terechtgekomen"
    ],
    "correct": 0,
    "explanation": "'Uitkomen' = openbaar worden, naar buiten komen. Gebruik: de waarheid komt uit, het geheim komt uit, nieuws komt uit.",
    "wrongExplanations": {
      "1": "'Meekomen' = samen met iemand gaan. De waarheid reist niet mee.",
      "2": "'Afkomen' = naar beneden komen of ergens naartoe komen. Een waarheid daalt niet.",
      "3": "'Terechtkomen' = ergens belanden. De waarheid belandt nergens — ze wordt onthuld."
    },
    "hint": "De waarheid was lang verborgen. Welk prefix past bij iets dat naar buiten komt?"
  },
  {
    "sentence": "Zijn nieuwe boek is vorige week ______.",
    "options": [
      "uitgekomen",
      "binnengekomen",
      "aangekomen",
      "opgekomen"
    ],
    "correct": 0,
    "explanation": "'Uitkomen' = gepubliceerd worden. Standaard voor boeken, albums, films en producten.",
    "wrongExplanations": {
      "1": "'Binnenkomen' = naar binnen gaan of ontvangen worden. Een boek komt niet binnen — het komt uit voor het publiek.",
      "2": "'Aankomen' = arriveren. Het boek is niet bezorgd — het is gepubliceerd.",
      "3": "'Opkomen' = omhoog verschijnen (zon) of opstaan voor iets. Boeken komen niet op zoals de zon."
    },
    "hint": "Het boek bestaat nu officieel voor het publiek. Welk prefix past bij iets dat naar buiten komt?"
  },
  {
    "sentence": "De berekening is precies ______.",
    "options": [
      "voorgekomen",
      "uitgekomen",
      "bijgekomen",
      "overgekomen"
    ],
    "correct": 1,
    "explanation": "'Uitkomen' = kloppen, het juiste resultaat geven. Gebruik: de berekening klopt — ze komt precies uit.",
    "wrongExplanations": {
      "0": "'Voorkomen' = plaatsvinden of voor jezelf lijken. Een berekening vindt niet 'plaats' — ze klopt.",
      "2": "'Bijkomen' = herstellen of erbij komen. Een berekening herstelt niet.",
      "3": "'Overkomen' = een indruk maken op anderen of iemand overkomen. Een berekening maakt geen indruk — ze klopt."
    },
    "hint": "De uitkomst is precies goed. Welk prefix past bij een resultaat dat 'eruit komt'?"
  },
  {
    "sentence": "Dat komt goed ______!",
    "options": [
      "bij",
      "over",
      "uit",
      "voor"
    ],
    "correct": 2,
    "explanation": "'Uitkomen' = goed aflopen, goed kloppen. 'Dat komt goed uit' = het loopt goed af, het klopt precies.",
    "wrongExplanations": {
      "0": "'Bijkomen' = herstellen. Hier gaat het over een goede afloop, niet herstel.",
      "1": "'Overkomen' = een indruk maken op anderen. Dit gaat over een resultaat, niet een indruk.",
      "3": "'Voorkomen' = plaatsvinden of verhinderen. Je zegt dat het goed afloopt — niet dat het 'plaatsvindt'."
    },
    "hint": "De situatie loopt goed af. Welk prefix past bij iets dat 'eruit komt'?"
  },
  {
    "sentence": "Ze is eindelijk ______ voor haar mening.",
    "options": [
      "afgekomen",
      "bijgekomen",
      "uitgekomen",
      "binnengekomen"
    ],
    "correct": 2,
    "explanation": "'Uitkomen voor' = openlijk zeggen of erkennen wat je echt denkt of bent. Gebruik: uitkomen voor je mening, uitkomen voor je keuze, uitkomen voor je fouten.",
    "wrongExplanations": {
      "0": "'Afkomen' = naar beneden komen. Je daalt niet voor je mening.",
      "1": "'Bijkomen' = herstellen. Je herstelt niet van je mening.",
      "3": "'Binnenkomen' = naar binnen gaan. Je gaat nergens naar binnen voor je mening."
    },
    "hint": "Ze zegt nu openlijk wat ze echt vindt. Welk prefix past bij 'openlijk toegeven of verdedigen'?"
  },
  {
    "sentence": "Hij durft niet ______ voor zijn keuze.",
    "options": [
      "bij te komen",
      "mee te komen",
      "uit te komen",
      "op te komen"
    ],
    "correct": 2,
    "explanation": "'Uitkomen voor' = openlijk zeggen of erkennen. Verschil met 'opkomen voor': 'uitkomen voor' = openlijk bekennen; 'opkomen voor' = actief verdedigen.",
    "wrongExplanations": {
      "0": "'Bijkomen' = herstellen. Je herstelt niet van een keuze.",
      "1": "'Meekomen' = samen gaan. Je gaat nergens mee naartoe.",
      "3": "'Opkomen voor' = actief verdedigen tegenover anderen. 'Uitkomen voor' = openlijk erkennen en laten weten."
    },
    "hint": "Hij schaamt zich voor zijn keuze en wil het niet openlijk zeggen. Welk prefix past bij 'openlijk erkennen'?"
  },
  {
    "sentence": "Het ongeluk is op de snelweg ______.",
    "options": [
      "voorgekomen",
      "uitgekomen",
      "bijgekomen",
      "meegekomen"
    ],
    "correct": 0,
    "explanation": "'Voorkomen' = gebeuren, plaatsvinden. Gebruik: ongelukken komen voor, problemen komen voor, fouten komen voor.",
    "wrongExplanations": {
      "1": "'Uitkomen' = openbaar worden of kloppen. Een ongeluk wordt niet 'onthuld' — het gebeurt.",
      "2": "'Bijkomen' = herstellen. Een ongeluk herstelt niet — het vindt plaats.",
      "3": "'Meekomen' = samen bewegen. Een ongeluk reist niet mee — het gebeurt op een plek."
    },
    "hint": "Het ongeluk heeft plaatsgevonden. Welk werkwoord gebruik je als iets ergens gebeurt?"
  },
  {
    "sentence": "Dat woord komt me heel bekend ______.",
    "options": [
      "over",
      "bij",
      "voor",
      "aan"
    ],
    "correct": 2,
    "explanation": "'Voorkomen' = de indruk geven voor jezelf, lijken. 'Dat komt me bekend voor' = ik herken dat. Gebruik: bekend voorkomen, vreemd voorkomen, vertrouwd voorkomen.",
    "wrongExplanations": {
      "0": "'Overkomen' = een indruk maken op anderen. Hier gaat het om jóúw eigen herkenning, niet om wat anderen van jou vinden.",
      "1": "'Bijkomen' = herstellen. Je herstelt niet van een bekend woord.",
      "3": "'Aankomen' = arriveren of zwaarder worden. Past niet bij herkenning."
    },
    "hint": "Je herkent iets. Welk prefix past bij 'voor jou lijken'?"
  },
  {
    "sentence": "Het ongeluk had ______ kunnen worden als we beter hadden opgelet.",
    "options": [
      "meegekomen",
      "bijgekomen",
      "voorkomen",
      "terechtgekomen"
    ],
    "correct": 2,
    "explanation": "'Voorkomen' = verhinderen dat iets slechts gebeurt. Gebruik: een ongeluk voorkomen, fouten voorkomen, problemen voorkomen.",
    "wrongExplanations": {
      "0": "'Meekomen' = samen bewegen. Een ongeluk reist niet mee.",
      "1": "'Bijkomen' = herstellen. Je herstelt niet van een hypothetisch ongeluk.",
      "3": "'Terechtkomen' = ergens belanden. Je wil het ongeluk stoppen — niet ergens belanden."
    },
    "hint": "Het ongeluk kon vermeden worden. Welk werkwoord gebruik je voor 'iets tegenhouden'?"
  },
  {
    "sentence": "Dat komt me niet bekend ______.",
    "options": [
      "over",
      "bij",
      "voor",
      "uit"
    ],
    "correct": 2,
    "explanation": "'Voorkomen' = lijken, de indruk geven voor jezelf. 'Dat komt me niet voor' = dat herken ik niet.",
    "wrongExplanations": {
      "0": "'Overkomen' = een indruk maken op anderen. Hier gaat het om jóúw eigen herkenning.",
      "1": "'Bijkomen' = herstellen. Je herkent het woord niet — je herstelt er niet van.",
      "3": "'Uitkomen' = openbaar worden. Het woord wordt niet onthuld — het komt je al dan niet bekend voor."
    },
    "hint": "Je herkent het niet. Welk prefix past bij 'voor jou lijken'?"
  },
  {
    "sentence": "Dit probleem moet niet meer ______.",
    "options": [
      "meekomen",
      "bijkomen",
      "voorkomen",
      "aankomen"
    ],
    "correct": 2,
    "explanation": "'Voorkomen' = vermijden, verhinderen dat iets gebeurt. Let op de context: hier is 'voorkomen' = verhinderen — niet 'plaatsvinden'.",
    "wrongExplanations": {
      "0": "'Meekomen' = samen bewegen. Een probleem reist niet mee.",
      "1": "'Bijkomen' = herstellen of erbij komen. Je wilt juist dat het probleem er níet bijkomt.",
      "3": "'Aankomen' = arriveren of zwaarder worden. Je wilt het probleem stoppen — niet het laten aankomen."
    },
    "hint": "Je wilt dit probleem stoppen vóórdat het weer gebeurt. Welk prefix past bij 'voorkomen dat iets gebeurt'?"
  },
  {
    "sentence": "We moeten fouten in de communicatie ______.",
    "options": [
      "bijkomen",
      "voorkomen",
      "meekomen",
      "uitkomen"
    ],
    "correct": 1,
    "explanation": "'Voorkomen' = verhinderen dat iets slechts gebeurt. Gebruik: fouten voorkomen, misverstanden voorkomen, ongelukken voorkomen.",
    "wrongExplanations": {
      "0": "'Bijkomen' = herstellen of erbij komen. Je wilt juist dat fouten er níet bijkomen.",
      "2": "'Meekomen' = samen bewegen. Fouten reizen niet mee.",
      "3": "'Uitkomen' = openbaar worden. Je wilt fouten stoppen — niet ze openbaar laten worden."
    },
    "hint": "Je wilt fouten vermijden. Welk prefix past bij 'verhinderen dat iets gebeurt'?"
  },
  {
    "sentence": "Hij komt altijd heel aardig ______.",
    "options": [
      "voor",
      "aan",
      "bij",
      "over"
    ],
    "correct": 3,
    "explanation": "'Overkomen' = de indruk wekken op anderen. Anderen zien hem als aardig. Verschil: 'overkomen' = indruk op anderen; 'voorkomen' = indruk voor jezelf.",
    "wrongExplanations": {
      "0": "'Voorkomen' = voor jezelf lijken. Hier gaat het om de indruk op andere mensen, niet jouw eigen gevoel.",
      "2": "'Bijkomen' = herstellen. Je herstelt niet van aardig zijn.",
      "1": "'Aankomen' = arriveren of zwaarder worden. Past niet bij een indruk maken."
    },
    "hint": "Anderen zien hem als aardig. Welk prefix past bij een indruk die op anderen overkomt?"
  },
  {
    "sentence": "Zijn verhaal is niet goed ______.",
    "options": [
      "overgekomen",
      "uitgekomen",
      "bijgekomen",
      "afgekomen"
    ],
    "correct": 0,
    "explanation": "'Overkomen' = de indruk wekken op anderen. Het verhaal maakte een slechte indruk op de luisteraars.",
    "wrongExplanations": {
      "1": "'Uitkomen' = openbaar worden of kloppen. Een verhaal wordt niet 'onthuld' — het maakt een indruk.",
      "2": "'Bijkomen' = herstellen. Een verhaal herstelt niet.",
      "3": "'Afkomen' = naar beneden komen. Een verhaal daalt niet."
    },
    "hint": "Het verhaal maakte een slechte indruk op de luisteraars. Welk prefix past bij een indruk die op iemand overkomt?"
  },
  {
    "sentence": "Hoe komt jouw boodschap ______ bij de klanten?",
    "options": [
      "aan",
      "over",
      "bij",
      "voor"
    ],
    "correct": 1,
    "explanation": "'Overkomen' = de indruk maken op anderen, begrepen worden. Gebruik: 'je boodschap overkomen' = hoe anderen jouw communicatie ervaren.",
    "wrongExplanations": {
      "0": "'Aankomen' = arriveren of zwaarder worden. 'Overkomen' is het specifieke werkwoord voor de indruk die jouw communicatie maakt op anderen.",
      "2": "'Bijkomen' = herstellen. Klanten herstellen niet van een boodschap.",
      "3": "'Voorkomen' = voor jezelf lijken. Hier gaat het om de indruk op anderen, niet op jouzelf."
    },
    "hint": "Je vraagt welke indruk jouw communicatie maakt op klanten. Welk prefix past bij 'de indruk die iemand krijgt'?"
  },
  {
    "sentence": "Zoiets kan iedereen ______.",
    "options": [
      "bijkomen",
      "overkomen",
      "meekomen",
      "uitkomen"
    ],
    "correct": 1,
    "explanation": "'Overkomen' = iemand overkomen = iets meemaken, iets dat jou overkomt. Gebruik: zoiets kan iedereen overkomen, wat is jou overkomen?",
    "wrongExplanations": {
      "0": "'Bijkomen' = herstellen. Dat is wat je doet nádát iets je is overkomen.",
      "2": "'Meekomen' = samen gaan of bijhouden. Iets gaat niet 'mee' met iemand.",
      "3": "'Uitkomen' = openbaar worden. Dingen die je meemaakt worden niet 'onthuld'."
    },
    "hint": "Het kan iedereen gebeuren. Welk prefix past bij 'iemand overkomen' als iets iemand overkomt?"
  },
  {
    "sentence": "Ze is van de trap ______.",
    "options": [
      "opgekomen",
      "bijgekomen",
      "afgekomen",
      "terechtgekomen"
    ],
    "correct": 2,
    "explanation": "'Afkomen' = naar beneden komen, van een hoogte aflopen. Gebruik: van de trap afkomen, van het podium afkomen.",
    "wrongExplanations": {
      "0": "'Opkomen' = omhoog komen. Ze gaat juist naar benéden van de trap.",
      "1": "'Bijkomen' = herstellen. Ze beweegt — ze herstelt niet.",
      "3": "'Terechtkomen' = ergens belanden. Ze loopt van de trap af — ze belandt niet toevallig ergens."
    },
    "hint": "Ze staat boven en beweegt naar beneden. Welk prefix past bij een neerwaartse beweging?"
  },
  {
    "sentence": "De muzikant is het podium ______.",
    "options": [
      "meegekomen",
      "binnengekomen",
      "opgekomen",
      "afgekomen"
    ],
    "correct": 3,
    "explanation": "'Afkomen' = naar beneden komen of een plek verlaten. Tegenovergestelde: opkomen = het podium opgaan.",
    "wrongExplanations": {
      "0": "'Meekomen' = samen met iemand anders gaan. De muzikant vertrekt zelf.",
      "1": "'Binnenkomen' = naar binnen gaan. De muzikant verlaat het podium — hij gaat niet naar binnen.",
      "2": "'Opkomen' = het podium opgaan. Dat is het tegenovergestelde van wat hier beschreven wordt."
    },
    "hint": "De muzikant staat op het podium en verlaat het. Welk prefix past bij een neerwaartse beweging?"
  },
  {
    "sentence": "Kom je morgen ook naar het feest ______?",
    "options": [
      "af",
      "mee",
      "bij",
      "op"
    ],
    "correct": 0,
    "explanation": "'Afkomen' = ergens naartoe komen, verschijnen op een afspraak. 'Erop afkomen' = ernaartoe gaan. Gebruik: op het feest afkomen, op de uitnodiging afkomen.",
    "wrongExplanations": {
      "1": "'Meekomen' = samen met iemand anders gaan. 'Kom je mee?' zou anders geformuleerd zijn — hier vraag je of iemand zelf naar het feest komt.",
      "2": "'Bijkomen' = herstellen. Je herstelt niet bij een feest.",
      "3": "'Opkomen' = omhoog verschijnen of opstaan voor iets. Past niet bij een feest bezoeken."
    },
    "hint": "Je vraagt of iemand naar het feest toe komt. 'Erop afkomen' = ernaartoe gaan."
  },
  {
    "sentence": "Hoe ben je bij dit bedrijf ______?",
    "options": [
      "terechtgekomen",
      "aangekomen",
      "opgekomen",
      "meegekomen"
    ],
    "correct": 0,
    "explanation": "'Terechtkomen' = ergens belanden, via een weg of toeval ergens uitkomen. Gebruik: bij een bedrijf terechtkomen, in een stad terechtkomen, in een moeilijke situatie terechtkomen.",
    "wrongExplanations": {
      "1": "'Aankomen' = arriveren op een bestemming. Je vraagt niet hoe iemand fysiek arriveerde — je vraagt naar het verhaal erachter.",
      "2": "'Opkomen' = verschijnen of opstaan voor iets. Je komt niet op bij een bedrijf — je belandt er.",
      "3": "'Meekomen' = samen gaan. Je bent er zelf beland, niet met iemand mee."
    },
    "hint": "Je vraagt naar iemands carrièrepad. Welk werkwoord past bij 'ergens belanden'?"
  },
  {
    "sentence": "Waar zijn mijn sleutels ______?",
    "options": [
      "aangekomen",
      "terechtgekomen",
      "meegekomen",
      "bijgekomen"
    ],
    "correct": 1,
    "explanation": "'Terechtkomen' = ergens belanden, na zoeken of verliezen. Gebruik: sleutels terechtkomen, post terechtkomen, geld terechtkomen.",
    "wrongExplanations": {
      "0": "'Aankomen' = arriveren op een bekende bestemming. Sleutels arriveren niet bewust ergens.",
      "2": "'Meekomen' = samen bewegen. Sleutels reizen niet bewust mee.",
      "3": "'Bijkomen' = herstellen. Sleutels herstellen nergens van."
    },
    "hint": "Je bent je sleutels kwijt en vraagt waar ze beland zijn. Welk werkwoord past bij 'ergens belanden'?"
  },
  {
    "sentence": "Ken je een plek waar ik vanavond ______ kan?",
    "options": [
      "aankomen",
      "bijkomen",
      "langskomen",
      "terechtkomen"
    ],
    "correct": 3,
    "explanation": "'Terechtkomen' = ergens onderdak vinden, ergens belanden voor de nacht. Gebruik: ergens voor de nacht terechtkomen, ergens terecht kunnen.",
    "wrongExplanations": {
      "0": "'Aankomen' = arriveren. Je vraagt niet alleen om aan te komen — je zoekt een plek om te verblijven.",
      "1": "'Bijkomen' = herstellen. Je zoekt onderdak — je herstelt niet van iets.",
      "2": "'Langskomen' = even op bezoek komen. Je zoekt niet een bezoekplek — je zoekt onderdak voor de nacht."
    },
    "hint": "Je zoekt een plek om vanavond te slapen. Welk werkwoord past bij 'ergens onderdak vinden'?"
  },
  {
    "sentence": "Ik ben er net ______ dat hij gelogen heeft.",
    "options": [
      "bijgekomen",
      "terechtgekomen",
      "achtergekomen",
      "voorgekomen"
    ],
    "correct": 2,
    "explanation": "'Achterkomen' = ontdekken, te weten komen. Gebruik: achterkomen dat iemand liegt, achterkomen wat er is gebeurd.",
    "wrongExplanations": {
      "0": "'Bijkomen' = herstellen. Je wilt iets ontdekken — niet herstellen.",
      "1": "'Terechtkomen' = ergens belanden. Je belandt nergens — je ontdekt iets.",
      "3": "'Voorkomen' = plaatsvinden of voor jezelf lijken. De leugen vond eerder plaats — jíj ontdekt hem nu."
    },
    "hint": "Iets was verborgen en jij hebt het nu ontdekt. Welk prefix past bij 'van achteren iets te pakken krijgen'?"
  },
  {
    "sentence": "Ik kan er niet ______ wat er precies is gebeurd.",
    "options": [
      "bijkomen",
      "meekomen",
      "achterkomen",
      "uitkomen"
    ],
    "correct": 2,
    "explanation": "'Achterkomen' = ontdekken, te weten komen. Gebruik: achterkomen wat er is gebeurd, achterkomen hoe iets werkt.",
    "wrongExplanations": {
      "0": "'Bijkomen' = herstellen. Je wilt iets ontdekken — niet herstellen.",
      "1": "'Meekomen' = samen gaan of bijhouden. Je gaat nergens naartoe.",
      "3": "'Uitkomen' = openbaar worden. Het gaat niet vanzelf openbaar — jíj probeert het te ontdekken."
    },
    "hint": "Je probeert te ontdekken wat er is gebeurd. Welk prefix past bij 'van achteren iets te pakken krijgen'?"
  },
  {
    "sentence": "De buurman is even ______ voor koffie.",
    "options": [
      "meegekomen",
      "terechtgekomen",
      "opgekomen",
      "langsgekomen"
    ],
    "correct": 3,
    "explanation": "'Langskomen' = op bezoek komen, even aanlopen. Gebruik: langskomen voor koffie, langskomen om te praten, langskomen bij iemand.",
    "wrongExplanations": {
      "0": "'Meekomen' = samen met iemand anders gaan. De buurman komt zelf — hij gaat niet mee.",
      "1": "'Terechtkomen' = ergens belanden. De buurman belandt niet bij jou — hij bezoekt je bewust.",
      "2": "'Opkomen' = verschijnen of opstaan voor iets. De buurman verschijnt niet als de zon."
    },
    "hint": "De buurman bezoekt je even. Welk prefix past bij iemand die even langsloopt?"
  },
  {
    "sentence": "Ik kom volgende week even ______ om de documenten te tekenen.",
    "options": [
      "aan",
      "langs",
      "bij",
      "voor"
    ],
    "correct": 1,
    "explanation": "'Langskomen' = even op bezoek komen voor een bepaald doel. Gebruik: langskomen voor een handtekening, langskomen om iets af te geven.",
    "wrongExplanations": {
      "0": "'Aankomen' = arriveren op een bestemming. Je komt even langs — niet als officieel bezoek met een aankomstpunt.",
      "2": "'Bijkomen' = herstellen. Je herstelt niet van documenten.",
      "3": "'Voorkomen' = plaatsvinden of voor jezelf lijken. Past niet bij een kort bezoek."
    },
    "hint": "Je gaat even naar kantoor voor de handtekening. Welk prefix past bij 'even op bezoek komen'?"
  },
  {
    "sentence": "Ik ben Lisa gisteren in de stad ______.",
    "options": [
      "aangekomen",
      "voorgekomen",
      "bijgekomen",
      "tegengekomen"
    ],
    "correct": 3,
    "explanation": "'Tegenkomen' = toevallig ontmoeten. Gebruik: iemand tegenkomen in de stad, een vriend tegenkomen, iets onverwachts tegenkomen.",
    "wrongExplanations": {
      "0": "'Aankomen' = arriveren. Je arriveert niet bij Lisa — je komt haar toevallig tegen.",
      "1": "'Voorkomen' = plaatsvinden of voor jezelf lijken. Je ontmoet haar toevallig — dat is niet 'plaatsvinden'.",
      "2": "'Bijkomen' = herstellen. Je herstelt niet van Lisa."
    },
    "hint": "Je liep door de stad en zag Lisa toevallig. Welk prefix past bij 'per ongeluk ontmoeten'?"
  },
  {
    "sentence": "Welke problemen kom je ______ in jouw werk?",
    "options": [
      "bij",
      "aan",
      "tegen",
      "voor"
    ],
    "correct": 2,
    "explanation": "'Tegenkomen' = stuiten op, ontdekken in de praktijk. Gebruik: problemen tegenkomen, obstakels tegenkomen, iets onverwachts tegenkomen.",
    "wrongExplanations": {
      "0": "'Bijkomen' = herstellen of erbij komen. Je herstelt niet van problemen.",
      "1": "'Aankomen' = arriveren of zwaarder worden. Je arriveert niet bij problemen.",
      "3": "'Voorkomen' = plaatsvinden. 'Welke problemen komen voor' gaat over het bestaan ervan — 'tegenkomen' gaat over jouw eigen ervaring ermee."
    },
    "hint": "Je vraagt welke problemen iemand zelf tegenkomt in zijn werk. Welk prefix past bij 'stuiten op'?"
  },
  {
    "sentence": "Veel mensen zijn bij het ongeluk ______.",
    "options": [
      "aangekomen",
      "omgekomen",
      "terechtgekomen",
      "uitgekomen"
    ],
    "correct": 1,
    "explanation": "'Omkomen' = sterven bij een ongeluk of ramp. Altijd bij een ongeluk of ramp — niet op natuurlijke wijze.",
    "wrongExplanations": {
      "0": "'Aankomen' = arriveren. Mensen arriveren niet bij een ongeluk in deze tragische betekenis.",
      "2": "'Terechtkomen' = ergens belanden. Dit is een definitief, onomkeerbaar gevolg — dat is 'omkomen'.",
      "3": "'Uitkomen' = openbaar worden. Een ongeluk wordt niet 'onthuld'."
    },
    "hint": "Dit is een onomkeerbaar gevolg van een ongeluk. Welk prefix geeft dit aan?"
  },
  {
    "sentence": "Waar komt dat geluid ______?",
    "options": [
      "af",
      "bij",
      "mee",
      "vandaan"
    ],
    "correct": 3,
    "explanation": "'Ergens vandaan komen' = de oorsprong of bron hebben op een bepaalde plek. Gebruik: waar komt dat vandaan?, dat geluid komt van buiten vandaan.",
    "wrongExplanations": {
      "0": "'Afkomen' = naar beneden komen. Het geluid daalt niet — het heeft een bron.",
      "1": "'Bijkomen' = herstellen. Een geluid herstelt niet.",
      "2": "'Meekomen' = samen bewegen. Je vraagt naar de bron, niet naar het gezelschap van het geluid."
    },
    "hint": "Je vraagt naar de oorsprong van het geluid. Welk woord past bij 'ergens vandaan komen'?"
  },
  {
    "sentence": "Er is een klacht van een klant ______.",
    "options": [
      "aangekomen",
      "binnengekomen",
      "opgekomen",
      "voorgekomen"
    ],
    "correct": 1,
    "explanation": "'Binnenkomen' = ontvangen worden, van buiten naar binnen gaan. Standaard voor e-mails, klachten, berichten en sollicitaties.",
    "wrongExplanations": {
      "0": "'Aankomen' = arriveren. Past beter bij een pakket — een klacht 'komt binnen' bij de klantenservice.",
      "2": "'Opkomen' = omhoog verschijnen. Een klacht verschijnt niet als de zon.",
      "3": "'Voorkomen' = plaatsvinden of voor jezelf lijken. Een klacht vindt niet 'plaats' — ze wordt ontvangen."
    },
    "hint": "De klacht is bij het bedrijf ontvangen. Welk prefix past bij iets dat van buiten naar binnen gaat?"
  },
  {
    "sentence": "Er zijn al twintig reacties op de vacature ______.",
    "options": [
      "terechtgekomen",
      "overgekomen",
      "binnengekomen",
      "uitgekomen"
    ],
    "correct": 2,
    "explanation": "'Binnenkomen' = ontvangen worden. Standaard voor reacties, sollicitaties, berichten en klachten.",
    "wrongExplanations": {
      "0": "'Terechtkomen' = ergens belanden. Reacties belanden niet — ze worden ontvangen.",
      "1": "'Overkomen' = een indruk maken op anderen. Reacties maken geen indruk — ze komen binnen.",
      "3": "'Uitkomen' = openbaar worden. Reacties worden niet onthuld — ze worden ontvangen."
    },
    "hint": "De sollicitaties zijn bij het bedrijf ontvangen. Welk prefix past bij 'ontvangen worden'?"
  },
  {
    "sentence": "Ik kom hier in de volgende vergadering op ______.",
    "options": [
      "af",
      "bij",
      "terug",
      "mee"
    ],
    "correct": 2,
    "explanation": "'Terugkomen op' = een onderwerp later opnieuw bespreken. Vaste uitdrukking in vergaderingen en zakelijke context.",
    "wrongExplanations": {
      "0": "'Afkomen' = naar beneden of ergens naartoe komen. Je gaat niet naar beneden op een onderwerp.",
      "1": "'Bijkomen' = herstellen. Je herstelt niet van een vergaderonderwerp.",
      "3": "'Meekomen' = samen gaan. Je gaat niet mee met het onderwerp."
    },
    "hint": "Je belooft later over dit onderwerp te praten. Welk prefix past bij 'opnieuw bespreken'?"
  },
  {
    "sentence": "Kan ik daar later op ______?",
    "options": [
      "bijkomen",
      "terugkomen",
      "meekomen",
      "uitkomen"
    ],
    "correct": 1,
    "explanation": "'Terugkomen op' = later op een punt reageren of terugpakken. Gebruik: terugkomen op een voorstel, terugkomen op een vraag.",
    "wrongExplanations": {
      "0": "'Bijkomen' = herstellen. Je herstelt niet van een punt.",
      "2": "'Meekomen' = samen gaan. Je gaat nergens naartoe.",
      "3": "'Uitkomen' = openbaar worden. Je maakt het punt niet openbaar — je reageert erop."
    },
    "hint": "Je wilt later reageren op een punt in de vergadering. Welk prefix past bij 'later opnieuw pakken'?"
  },
  {
    "sentence": "Je moet je afspraken altijd ______.",
    "options": [
      "bijkomen",
      "nakomen",
      "terugkomen",
      "binnenkomen"
    ],
    "correct": 1,
    "explanation": "'Nakomen' = naleven, doen wat je hebt beloofd. Gebruik: afspraken nakomen, verplichtingen nakomen, beloften nakomen.",
    "wrongExplanations": {
      "0": "'Bijkomen' = herstellen of erbij komen. Je herstelt niet van afspraken.",
      "2": "'Terugkomen' = teruggaan naar een eerdere plek of onderwerp. Afspraken haal je niet terug — je komt ze na.",
      "3": "'Binnenkomen' = naar binnen gaan of ontvangen worden. Afspraken komen niet naar binnen."
    },
    "hint": "Je moet doen wat je hebt beloofd. Welk prefix past bij 'beloften waarmaken'?"
  },
  {
    "sentence": "Het bedrijf is zijn verplichtingen niet ______.",
    "options": [
      "bijgekomen",
      "meegekomen",
      "nagekomen",
      "uitgekomen"
    ],
    "correct": 2,
    "explanation": "'Nakomen' = naleven, voldoen aan verplichtingen of afspraken. Gebruik: verplichtingen nakomen, contracten nakomen.",
    "wrongExplanations": {
      "0": "'Bijkomen' = herstellen. Je herstelt niet van verplichtingen.",
      "1": "'Meekomen' = samen gaan. Verplichtingen reizen niet mee.",
      "3": "'Uitkomen' = openbaar worden. Verplichtingen worden niet onthuld — ze worden nageleefd of niet."
    },
    "hint": "Het bedrijf heeft zijn beloften niet nagekomen. Welk prefix past bij 'naleven'?"
  },
  {
    "sentence": "We zijn ______ dat de deadline wordt verlengd.",
    "options": [
      "uitgekomen",
      "aangekomen",
      "terechtgekomen",
      "overeengekomen"
    ],
    "correct": 3,
    "explanation": "'Overeenkomen' = het eens worden, afspreken. Gebruik: overeenkomen dat iets gebeurt, overeenkomen over de prijs.",
    "wrongExplanations": {
      "1": "'Aankomen' = arriveren. Je arriveert niet bij een afspraak — je maakt hem.",
      "2": "'Terechtkomen' = ergens belanden. Je belandt niet bij een beslissing — je neemt hem samen.",
      "0": "'Uitkomen' = openbaar worden of kloppen. De deadline wordt niet onthuld — jullie spreken hem samen af."
    },
    "hint": "Jullie hebben samen besloten. Welk prefix past bij 'het eens worden'?"
  },
  {
    "sentence": "Dat komt me vreemd ______.",
    "options": [
      "bij",
      "aan",
      "over",
      "voor"
    ],
    "correct": 3,
    "explanation": "'Voorkomen' = lijken, de indruk geven voor jezelf. 'Dat komt me vreemd voor' = ik vind dat vreemd. Vergelijk: 'overkomen' = indruk op anderen; 'voorkomen' = jouw eigen gevoel.",
    "wrongExplanations": {
      "0": "'Bijkomen' = herstellen. Je herstelt niet van iets vreemds.",
      "1": "'Aankomen' = arriveren of zwaarder worden. Past niet bij een oordeel of gevoel.",
      "2": "'Overkomen' = een indruk maken op anderen. Hier gaat het om jóúw eigen ervaring, niet wat anderen van jou vinden."
    },
    "hint": "Je vindt iets vreemd. Welk prefix past bij 'voor jou lijken'?"
  },
  {
    "sentence": "Hij vindt het moeilijk om ______ van zijn oude gewoonten.",
    "options": [
      "bij te komen",
      "los te komen",
      "mee te komen",
      "voor te komen"
    ],
    "correct": 1,
    "explanation": "'Loskomen van' = je vrijmaken van iets dat je vasthoudt. Figuurlijk gebruik voor gewoonten, herinneringen of mensen.",
    "wrongExplanations": {
      "0": "'Bijkomen' = herstellen. Je herstelt niet van gewoonten — je laat ze los.",
      "2": "'Meekomen' = samen gaan. Je gaat nergens naartoe.",
      "3": "'Voorkomen' = verhinderen. Je voorkomt de gewoonten niet — je wil los ervan komen."
    },
    "hint": "Hij wil zich bevrijden van iets dat hem vasthoudt. Welk prefix past bij 'vrij worden van'?"
  },
  {
    "sentence": "Na jaren therapie begon ze eindelijk ______ van haar verleden.",
    "options": [
      "los te komen",
      "mee te komen",
      "voor te komen",
      "bij te komen"
    ],
    "correct": 0,
    "explanation": "'Loskomen van' = je bevrijden van iets dat je heeft vastgehouden — emotioneel of psychologisch. Verschil met 'bijkomen': 'bijkomen' is kort herstel na een schrik; 'loskomen' is een langdurig bevrijdingsproces.",
    "wrongExplanations": {
      "1": "'Meekomen' = samen gaan. Ze gaat nergens naartoe.",
      "2": "'Voorkomen' = verhinderen. Ze voorkomt haar verleden niet — ze laat het los.",
      "3": "'Bijkomen' = herstellen na een schrik of klap. 'Loskomen' is een langdurig proces van bevrijding — dat is iets anders."
    },
    "hint": "Ze bevrijdt zich langzaam van haar verleden. Welk prefix past bij 'je bevrijden van iets dat je vasthoudt'?"
  },
  {
    "sentence": "Kun je mij even bellen? Ik kan niet ______ via e-mail.",
    "options": [
      "bijkomen",
      "doorkomen",
      "uitkomen",
      "meekomen"
    ],
    "correct": 1,
    "explanation": "'Doorkomen' = iemand bereiken, contact krijgen. Gebruik: doorkomen via telefoon, doorkomen via e-mail, doorkomen bij een helpdesk.",
    "wrongExplanations": {
      "0": "'Bijkomen' = herstellen. Je herstelt niet van e-mail.",
      "2": "'Uitkomen' = openbaar worden of kloppen. De e-mail wordt niet 'onthuld'.",
      "3": "'Meekomen' = samen gaan of bijhouden. Je volgt niemand."
    },
    "hint": "Je kunt iemand niet bereiken via e-mail. Welk prefix past bij 'contact krijgen'?"
  },
  {
    "sentence": "Hoe ben je door de moeilijke periode ______?",
    "options": [
      "bijgekomen",
      "opgekomen",
      "doorgekomen",
      "meegekomen"
    ],
    "correct": 2,
    "explanation": "'Doorkomen' = een moeilijke tijd overleven, er doorheen komen. Verschil: 'bijkomen' = herstellen nádát het voorbij is; 'doorkomen' = overleven terwijl het nog gaande is.",
    "wrongExplanations": {
      "0": "'Bijkomen' = herstellen nádát het voorbij is. 'Doorkomen' is het overleven tijdens de moeilijke periode zelf.",
      "1": "'Opkomen' = verschijnen of opstaan voor iets. Je staat niet op voor een moeilijke periode.",
      "3": "'Meekomen' = samen gaan of bijhouden. Je gaat nergens mee naartoe."
    },
    "hint": "Je vraagt hoe iemand een moeilijke tijd heeft overleefd. Welk prefix past bij 'er doorheen komen'?"
  },
  {
    "sentence": "Het komt ______ op samenwerking — niet op individuele prestaties.",
    "options": [
      "aan",
      "bij",
      "voor",
      "mee"
    ],
    "correct": 0,
    "explanation": "'Aankomen op' = wat echt telt, waar het om draait. 'Het komt aan op X' = X is de beslissende factor. Gebruik: het komt aan op samenwerking, het komt aan op kwaliteit.",
    "wrongExplanations": {
      "1": "'Bijkomen' = herstellen of erbij komen. Je herstelt niet van samenwerking.",
      "2": "'Voorkomen' = plaatsvinden of voor jezelf lijken. Samenwerking vindt hier niet 'plaats' — het is de sleutelfactor.",
      "3": "'Meekomen' = samen gaan. Je gaat nergens naartoe."
    },
    "hint": "Je zegt wat het beslissende element is. Welk prefix past bij 'waar het op neerkomt'?"
  },
  {
    "sentence": "Hij is ______ voor zijn fouten — dat vind ik knap.",
    "options": [
      "bijgekomen",
      "meegekomen",
      "overgekomen",
      "uitgekomen"
    ],
    "correct": 3,
    "explanation": "'Uitkomen voor' = openlijk erkennen of bekennen. 'Uitkomen voor je fouten' = toegeven dat je iets fout hebt gedaan. Gebruik: uitkomen voor je keuze, uitkomen voor je mening.",
    "wrongExplanations": {
      "0": "'Bijkomen' = herstellen. Hij herstelt niet van fouten — hij geeft ze toe.",
      "1": "'Meekomen' = samen gaan. Hij gaat nergens naartoe.",
      "2": "'Overkomen' = een indruk maken op anderen. Hij maakt een goede indruk — maar het gaat specifiek om zijn daad van erkenning."
    },
    "hint": "Hij erkent zijn fouten openlijk. Welk prefix past bij 'openlijk toegeven'?"
  },
  {
    "sentence": "Wij ______ altijd onze contractuele verplichtingen na.",
    "options": [
      "bijkomen",
      "overeenkomen",
      "komen",
      "uitkomen"
    ],
    "correct": 2,
    "explanation": "'Nakomen' = naleven, doen wat contractueel of moreel is afgesproken. Gebruik: verplichtingen nakomen, afspraken nakomen.",
    "wrongExplanations": {
      "0": "'Bijkomen' = herstellen. Je herstelt niet van verplichtingen.",
      "1": "'Overeenkomen' = het eens worden. Je hebt al afgesproken — nu kom je het na.",
      "3": "'Uitkomen' = openbaar worden. Verplichtingen worden niet onthuld — ze worden nageleefd."
    },
    "hint": "Je doet wat contractueel is afgesproken. Welk prefix past bij 'naleven'?"
  },
  {
    "sentence": "De vergadering loopt uit — we kunnen er niet ______ van het onderwerp.",
    "options": [
      "bijkomen",
      "vandaan komen",
      "meekomen",
      "uitkomen"
    ],
    "correct": 1,
    "explanation": "'Ergens vandaan komen' = je losmaken, het verlaten. 'We kunnen er niet vandaan komen' = we raken niet klaar, we kunnen het onderwerp niet loslaten.",
    "wrongExplanations": {
      "0": "'Bijkomen' = herstellen. Je herstelt niet van een vergadering.",
      "2": "'Meekomen' = samen gaan. Je gaat nergens naartoe.",
      "3": "'Uitkomen' = openbaar worden of kloppen. Het onderwerp wordt niet onthuld — jullie kunnen het niet loslaten."
    },
    "hint": "Jullie kunnen de vergadering niet verlaten. Welk woord past bij 'je ergens van losmaken'?"
  },
  {
    "sentence": "Slechts drie kandidaten zijn ______ naar de tweede ronde.",
    "options": [
      "meegekomen",
      "bijgekomen",
      "doorgekomen",
      "terechtgekomen"
    ],
    "correct": 2,
    "explanation": "'Doorkomen' = de selectie halen, naar de volgende fase gaan. Gebruik: doorkomen naar de volgende ronde, doorkomen in een wedstrijd.",
    "wrongExplanations": {
      "0": "'Meekomen' = samen gaan of bijhouden. Ze gaan niet mee met iemand — ze halen de selectie.",
      "1": "'Bijkomen' = herstellen of erbij komen. Ze komen er niet bij — ze gaan door naar de volgende fase.",
      "3": "'Terechtkomen' = ergens belanden. Ze belanden er niet toevallig — ze halen actief de selectie."
    },
    "hint": "Ze halen de selectie en gaan naar de volgende ronde. Welk prefix past bij 'een fase halen'?"
  }
]
